device-sdk/devicesdk/firmware/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_IOTKIT_LED_PIN=2
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_WS_BUFFER_SIZE=2048
# Resolve `<server>.local` over mDNS so devices flashed with e.g.
# `devicesdk.local:8080` reach the self-hosted server without a static IP.
# This routes one-shot `.local` lookups through the standard lwIP resolver
# (used by esp_websocket_client); IGMP is enabled by default in ESP-IDF lwIP.
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
